app/views/gprequests/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."gprequest_id" = $1  [["gprequest_id", 2]]
---
            <td><%= "Description: '#{gprequest.description}' - " %></td>
            <td><%= "has #{gprequest.votes.count} votes" %><td>