app/views/gprequests/rank.html.erb

    <% request_id = request[0] %>
    <% gprequest = Gprequest.find(request_id) %>
---
SELECT  "gprequests".* FROM "gprequests" WHERE "gprequests"."id" = $1 LIMIT 1  [["id", 16]]