app/controllers/gprequests_controller.rb

SELECT  "gprequests".* FROM "gprequests" WHERE "gprequests"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "votes" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 10], ["created_at", "2015-08-05 19:23:57.312513"], ["updated_at", "2015-08-05 19:23:57.312513"]]
UPDATE "votes" SET "gprequest_id" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["gprequest_id", 2], ["updated_at", "2015-08-05 19:23:57.332068"], ["id", 29]]
---
  def user_vote
    @gprequest = Gprequest.find(params[:id])
    @gprequest.votes << Vote.create(user: current_user)
    @gprequest.save

SELECT COUNT(*) FROM "votes" WHERE "votes"."gprequest_id" = $1  [["gprequest_id", 2]]
SELECT "gprequests".* FROM "gprequests"
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 LIMIT 1  [["user_id", 9]]
---
  def index
    @votecount = Vote.count
    @gprequests = Gprequest.all
    @allow_vote = true
    @vote_found = Vote.find_by(user_id: session[:user_id])

SELECT "gprequests".* FROM "gprequests" WHERE "gprequests"."user_id" = $1  [["user_id", 7]]
---
  def show
    @gprequests = Gprequest.where(user_id: session[:user_id])

INSERT INTO "gprequests" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "Fee Fie"], ["description", "Fo Fum"], ["created_at", "2015-07-24 21:39:16.105052"], ["updated_at", "2015-07-24 21:39:16.105052"]]
---
  def create
    @gprequest = Gprequest.new(gprequest_params)
    if @gprequest.save

SELECT "gprequests".* FROM "gprequests"
SELECT COUNT(*) FROM "votes" WHERE "votes"."gprequest_id" = $1  [["gprequest_id", 2]]
---
  def rank
    @gprequests = Gprequest.all
    rank_array = []     # an array of arrays
    @gprequests.each do |gprequest|
      rank_data = []
      vote_num = gprequest.votes.count